[
  {
    "id": "nova",
    "name": "Nova",
    "mainImgPath": "assets/images/nova2.png",
    "sliderImgPath": "assets/images/nova-slider.png",
    "snapshotImgPaths": [
      "assets/images/nova2.png",
      "assets/images/nova3.png",
      "assets/images/nova5.png",
      "assets/images/nova6.png"
    ],
    "shortDescription": "A fullstack, stand alone website built using ASP Core with login, payment, fulfillment, and review functionality",
    "longDescription": "<p>This website provides a seamless shopping experience from adding items to cart and checking them out to receiving email notification on order confirmation, order tracking lookup, and leaving product reviews. Logged in users may also manage their default addresses on profiles or see their order histories.</p><p>The admin pages were also designed with careful consideration to the user experience. Pagination and search filters are added in every page to make order and listing management easier. Asynchronous requests are used whenever possible to prevent the pages from frequent re-rendering and displacing the data in the table.</p>",
    "theme_ids": [3, 4, 7],
    "tag_ids": [3, 13, 7, 4, 16],
    "highlights": [
      "Handle authentication and authorization through Identity framework",
      "Incorporates preventative measures (data validation and cleaning, harmful text escaping)",
      "Integrate remote AzureDB through entity framework",
      "A fully responsive layout"
    ],
    "github": "https://github.com/alexfang324/nova"
  },
  {
    "id": "angular-profile",
    "name": "Angular Portfolio",
    "mainImgPath": "assets/images/profile1.png",
    "sliderImgPath": "assets/images/profile-slider.png",
    "snapshotImgPaths": [
      "assets/images/profile2.png",
      "assets/images/profile3.png",
      "assets/images/profile4.png",
      "assets/images/profile5.png"
    ],
    "shortDescription": "A responsive portfolio showcase with an artisitc layout and subtle animation. This very own webpage is the project!",
    "longDescription": "<p>This project is the portfolio website itself. Built using Angular, this project is not only serving as a show case for my other projects, but it’s also a learning opportunity to explore the similarities and difference of itself to React and Vue.</p><p>The layout of this website takes on a design studio-like styling to add yet another very different webpage design to my experience to demonstrate  my coding competence. The layout and font-size responsiveness of this website, together with the subtle UI animations crafted using only TypeScript and CSS, enhance the artistic touch of this website.</p>",
    "theme_ids": [1, 5, 6],
    "tag_ids": [1, 12, 14],
    "highlights": [
      "Clean and artisitic layout with small UI animations",
      "A fully responsive layout",
      "Built from planning to deploy within a week"
    ],
    "github": "https://github.com/alexfang324/angular-portfolio"
  },
  {
    "id": "audio-motor",
    "name": "Audio Motor",
    "mainImgPath": "assets/images/audio-main.png",
    "sliderImgPath": "assets/images/audio-slider.png",
    "snapshotImgPaths": [
      "assets/images/audio1.png",
      "assets/images/audio2.png",
      "assets/images/audio3.png",
      "assets/images/audio4.png"
    ],
    "shortDescription": "A visually rich brand page with a modern layout and fine grain responsiveness",
    "longDescription": "<p> Crafted with SASS, JavaScript, and HTML, this website is a modern showcase, mirroring the refined layouts and design details reminiscent of major brand websites. </p>",
    "theme_ids": [1, 4, 6],
    "tag_ids": [12, 7],
    "highlights": [
      "A fully responsive layout. Font sizes and element sizes tuned through multiple media queries to ensure the best reader experience on all devices",
      "Code reuse through SASS mixins and placeholders",
      "Crafted carousels and sliders through Slick",
      "Use of Gulp as build tool"
    ],
    "github": "https://github.com/alexfang324/audio-motor"
  },
  {
    "id": "ray-bike-suppreme",
    "name": "Ray Bike Suppreme",
    "mainImgPath": "assets/images/bike-main.png",
    "sliderImgPath": "assets/images/bike-slider.png",
    "snapshotImgPaths": [
      "assets/images/bike1.png",
      "assets/images/bike2.png",
      "assets/images/bike3.png",
      "assets/images/bike4.png"
    ],
    "shortDescription": "Simple JavaScript game with well-designed class inheritance hierarchy to demonstrate the powerful of object oriented programming",
    "longDescription": "<p>Built using only JavaScript, CSS, and HTML, this is a thrilling rendition of the classic snake game, amplified with obstacles and lasers. The project demonstrates the power of object oriented programming by employing a multi-level class inheritance scheme to maximize code reuse, requiring a careful analysis on the similarities and difference of sibling classes. The project also entails a physics aspect that requires math and coding competency to carry out the many-body interaction correctly in real time gameplay.</p>",
    "theme_ids": [1, 5, 7],
    "tag_ids": [7, 4],
    "highlights": [
      "Well-designed class inheritance hierarchy to promote code reuse",
      "A real-time gaming application necessitating precise numerical computation to deliver a seamless and immersive gameplay experience.",
      "Designed for scalability in object interaction complexity"
    ],
    "github": "https://github.com/alexfang324/ray-bike-suppreme",
    "url": "http://raybike.alexfang.ca"
  },
  {
    "id": "mvdb",
    "name": "MVDB Cinema",
    "mainImgPath": "assets/images/movie-main.png",
    "sliderImgPath": "assets/images/movie-slider.png",
    "snapshotImgPaths": [
      "assets/images/movie1.png",
      "assets/images/movie2.png",
      "assets/images/movie3.png",
      "assets/images/movie-main.png"
    ],
    "shortDescription": "A movie showcase website with real time data, immersive and thoughtful ui designs in React",
    "longDescription": "<p>This project showcases live movie data from MVDB API where users can view the synopsis and trailers of the latest movies. Through the live refresh search bar, user can also find movie information for older movies. Users can easily add movies to the favourite page and watch list page by hovering the cursor over the movie thumbnail to trigger its overlay screen. The layout of the website is designed to provide an immersive reading experience through the use of a background poster that fades outs at the bottom.</p>",
    "theme_ids": [1, 4, 6],
    "tag_ids": [10, 11, 7, 4],
    "highlights": [
      "Redux for state management",
      "Numerous interactive UI animations and features implemented to captivate the user",
      "A responsive and immersive layout",
      "Real time movie data from TMDB database"
    ],
    "github": "https://github.com/alexfang324/react-movie-app",
    "url": "https://react-movie-9wb2epgcq-alexs-projects-8f9f78b1.vercel.app/"
  },
  {
    "id": "mace-travel",
    "name": "Mace Travel",
    "mainImgPath": "assets/images/mace-main.png",
    "sliderImgPath": "assets/images/mace-slider.png",
    "snapshotImgPaths": [
      "assets/images/mace1.png",
      "assets/images/mace2.png",
      "assets/images/mace3.png"
    ],
    "shortDescription": "Multi-page teamwork project that explores the concept of responsive design and JQuery",
    "longDescription": "<p>Mace Travel is an interstellar travel agency site that offers vacation packages to aliens. It’s our first collaborative attempt to responsive web design in a team environment. The website is built using JQuery for toggling components on and off and for simple ui animations</p>",
    "theme_ids": [1, 4, 6],
    "tag_ids": [7, 4],
    "highlights": [
      "Built using only HTML, CSS, and JQuery",
      "A responsive layout"
    ],
    "github": "https://github.com/alexfang324/mace-travel-agency",
    "url": "http://mace.alexfang.ca"
  },
  {
    "id": "ticket-app",
    "name": "Microservice Ticketing App",
    "mainImgPath": "assets/images/ticket-main.png",
    "sliderImgPath": "assets/images/ticket-slider.png",
    "snapshotImgPaths": [
      "assets/images/ticket1.png",
      "assets/images/ticket2.png",
      "assets/images/ticket4.png",
      "assets/images/ticket5.png"
    ],
    "shortDescription": "A self-learning project that employs a microservice architecture deployed on Google Cloud Platform",
    "longDescription": "This self-learning project builds a ticket selling website that employes a microservice architecture using Docker and Kubernetes to explore the power of horizontal scalability under a high traffic volume. The app was deployed on Google Cloud Platform with CICD handled through GitHub Action",
    "theme_ids": [3, 5, 7],
    "tag_ids": [5, 8, 9, 14],
    "highlights": [
      "Employes a microservice architecture deployed on Google Cloud Platform",
      "Implemented CICD through GitHub Action",
      "written unit tests in Jest to validate code behavior",
      "handled user authentication through Google sign-in"
    ],
    "github": "https://github.com/alexfang324/microservice-ticketing-site"
  },
  {
    "id": "streaming-app",
    "name": "React Redux Streaming App",
    "mainImgPath": "assets/images/stream-main.png",
    "sliderImgPath": "assets/images/stream-slider.png",
    "snapshotImgPaths": [
      "assets/images/stream1.png",
      "assets/images/stream2.png",
      "assets/images/stream3.png",
      "assets/images/stream4.png"
    ],
    "shortDescription": "A self-learning project in React and Redux that builts a usable live streaming website with user authentication",
    "longDescription": "A self-learning project that allows signed-in users to live stream themselves or check out other live streams. The site utilizes the React and Redux to build the single page application with state management and RTMP server to handle the live streaming through connection with OBS Studio.",
    "theme_ids": [3, 5, 7],
    "tag_ids": [10, 11, 7],
    "highlights": [
      "Allow users to live stream and watch live stream",
      "Implemented both class components and functional components"
    ],
    "github": "https://github.com/alexfang324/react-redux-streaming-site"
  },
  {
    "id": "express-billing",
    "name": "Express Billing",
    "mainImgPath": "assets/images/billing-main.png",
    "sliderImgPath": "assets/images/billing-slider.png",
    "snapshotImgPaths": [
      "assets/images/billing1.png",
      "assets/images/billing2.png",
      "assets/images/billing3.png",
      "assets/images/billing4.png"
    ],
    "shortDescription": "A simple billing application with user authentication and authorization through passport.js",
    "longDescription": "This application allows adminstrator to add customer and items to the MongoDB database then create pdf invoices base on the order information. Signed in users can log on this app to view their invoices. The authentication and authorization are handled by Passport.js. This app is complete and ready to be pushed for production use.",
    "theme_ids": [3, 4, 7],
    "tag_ids": [9, 6, 7, 4, 17],
    "highlights": [
      "Authentication and authorization handled through Passport.js",
      "Views handled through EJS",
      "Data stored in a MongoDB database in the cloud"
    ],
    "github": "https://github.com/alexfang324/express-billing"
  }
]
